In [1]:
import pandas as pd
import numpy as np

In [5]:
df=pd.DataFrame({'key1' : ['a','a','b','b','a'],
                 'data1' : np.random.randint(100,200,5),
                 'data2' : np.random.randint(200,300,5)})
df

  key1  data1  data2
0    a    121    265
1    a    180    260
2    b    187    200
3    b    126    229
4    a    164    292

In [7]:
df.groupby('key1')

In [9]:
df.groupby('key1').sum()

      data1  data2
key1
a       465    817
b       313    429

In [11]:
df.groupby('key1').mean()

      data1       data2
key1
a     155.0  272.333333
b     156.5  214.500000

In [12]:
df.groupby('key1').count()

      data1  data2  key2
key1
a         3      3     3
b         2      2     2

In [10]:
df['key2']=['one','two','one','two','one']
df

  key1  data1  data2 key2
0    a    121    265  one
1    a    180    260  two
2    b    187    200  one
3    b    126    229  two
4    a    164    292  one

In [13]:
grouped=df.groupby(['key1','key2'])

In [14]:
grouped.first()

           data1  data2
key1 key2
a    one     121    265
     two     180    260
b    one     187    200
     two     126    229

In [15]:
for name, data in grouped:
    print(name)
    print()
    print(data)

('a', 'one')

  key1  data1  data2 key2
0    a    121    265  one
4    a    164    292  one
('a', 'two')

  key1  data1  data2 key2
1    a    180    260  two
('b', 'one')

  key1  data1  data2 key2
2    b    187    200  one
('b', 'two')

  key1  data1  data2 key2
3    b    126    229  two

In [16]:
for name, data in df.groupby('key1'):
    print(name)
    print(data)
    print()

a
  key1  data1  data2 key2
0    a    121    265  one
1    a    180    260  two
4    a    164    292  one

b
  key1  data1  data2 key2
2    b    187    200  one
3    b    126    229  two

In [18]:
df

  key1  data1  data2 key2
0    a    121    265  one
1    a    180    260  two
2    b    187    200  one
3    b    126    229  two
4    a    164    292  one

In [19]:
df.groupby('key1').first()

      data1  data2 key2
key1
a       121    265  one
b       187    200  one

In [21]:
df.groupby('key1').last()

      data1  data2 key2
key1
a       164    292  one
b       126    229  two

In [22]:
df

  key1  data1  data2 key2
0    a    121    265  one
1    a    180    260  two
2    b    187    200  one
3    b    126    229  two
4    a    164    292  one

In [23]:
df.groupby('key1')['data1']

In [24]:
df.groupby('key1')['data1'].first()

key1
a    121
b    187
Name: data1, dtype: int32

In [25]:
df

  key1  data1  data2 key2
0    a    121    265  one
1    a    180    260  two
2    b    187    200  one
3    b    126    229  two
4    a    164    292  one

In [27]:
df.groupby('key1')

In [28]:
df.groupby('key1').aggregate

In [29]:
df.groupby('key1').aggregate([min,max])

     data1      data2      key2
       min  max   min  max  min  max
key1
a      121  180   260  292  one  two
b      126  187   200  229  one  two

In [30]:
df.groupby('key1').aggregate({'data1':max,'data2':min})

      data1  data2
key1
a       180    260
b       187    200

In [35]:
df

  key1  data1  data2 key2
0    a    121    265  one
1    a    180    260  two
2    b    187    200  one
3    b    126    229  two
4    a    164    292  one

In [36]:
def abc(a):
    return a.max()-a.min()

In [38]:
df.groupby('key1').aggregate(abc)

      data1  data2
key1
a        59     32
b        61     29

In [39]:
df

  key1  data1  data2 key2
0    a    121    265  one
1    a    180    260  two
2    b    187    200  one
3    b    126    229  two
4    a    164    292  one

In [40]:
df.groupby('key1').std()

          data1      data2
key1
a     30.512293  17.214335
b     43.133514  20.506097

In [43]:
func = lambda x:x['data1'].std()>31
df.groupby('key1').filter(func)

  key1  data1  data2 key2
2    b    187    200  one
3    b    126    229  two

In [44]:
func = lambda x:x['data1'].std()<31
df.groupby('key1').filter(func)

  key1  data1  data2 key2
0    a    121    265  one
1    a    180    260  two
4    a    164    292  one

In [46]:
df.groupby('key1').mean()

      data1       data2
key1
a     155.0  272.333333
b     156.5  214.500000

In [45]:
df.groupby('key1').transform(lambda x: x-x.mean())

   data1      data2
0  -34.0  -7.333333
1   25.0 -12.333333
2   30.5 -14.500000
3  -30.5  14.500000
4    9.0  19.666667

In [ ]:
def norm_by_data2(x):
    x['data1']/=x['data2'].sum()